lkolbly/cmsis-svd/data/Huada/HDSC_HC32M120J6TB.svd
                <register>
                    <name>PCR14</name>
                    <description>desc PCR14</description>
                    <addressOffset>0x418</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR15</name>
                    <description>desc PCR15</description>
                    <addressOffset>0x41A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR16</name>
                    <description>desc PCR16</description>
                    <addressOffset>0x41C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR17</name>
                    <description>desc PCR17</description>
                    <addressOffset>0x41E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR20</name>
                    <description>desc PCR20</description>
                    <addressOffset>0x420</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCR21</name>
                    <description>desc PCR21</description>
                    <addressOffset>0x422</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F77</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE</name>
                            <description>desc POUTE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOD</name>
                            <description>desc NOD</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DRV</name>
                            <description>desc DRV</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LTE</name>
                            <description>desc LTE</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PUU</name>
                            <description>desc PUU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INVE</name>
                            <description>desc INVE</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CINSEL</name>
                            <description>desc CINSEL</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTE</name>
                            <description>desc INTE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSEL</name>
                            <description>desc FSEL</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
